In [1]:
a=20
b=30
c=30
a+b+c

80

================== EDA ==========================
1) Pandas : Data frame applications

2) Numpy  : Numerical python All math applications

3) Matplotlib: used for plotting

4) Seaborn   : used for plot

5) plotly    : use for plot

6) Bokhe     : plot

=================== Machine learning ==================
7) Sickit-learn: sklearn

===================== Deep Learning ==================
8) Tensorflow : Google

9) Keras      : Google

10) Pytorch   : FaceBook

====================== NLP ===========================
11) NLTK    : Natural langague tool kit 

12) Scipy

================ BERT =============================
13) Transformers : Hugging face (Google)

============ Google models =======================
14) Specific google packages

============== Azure ML=========================
15) Azure packages

============= GenAI ==============================
16) Gemini : Google

17) ChatGPT : OpenAI

====================== LangChain==================
18) LangChain packages

**Create a dataframe using list**

**Step 1- Create a Dataframe**

In [1]:
import pandas as pd #Alias name

pd.DataFrame()# empty data frame created no rows & no columns

Empty DataFrame
Columns: []
Index: []

**Step2- Provide the data**

In [11]:
names=['Arghyanil','Sangeeta','Rohit']
age=[27,28,26]
food=['Biryani','Pizza','Panipuri']
city=['Hyd','Jrd','Ghy']
pd.DataFrame(zip(age,food,city),names)
# what is the first positional argument: data
# second positional argument: index

            0         1    2
Arghyanil  27   Biryani  Hyd
Sangeeta   28     Pizza  Jrd
Rohit      26  Panipuri  Ghy

**Step3- Provide the column names**

In [15]:
names=['Arghyanil','Sangeeta','Rohit']
age=[27,28,26]
food=['Biryani','Pizza','Panipuri']
city=['Hyd','Jrd','Ghy']
cols=['Age','Food','City']
df=pd.DataFrame(zip(age,food,city),names,cols)
df

           Age      Food City
Arghyanil   27   Biryani  Hyd
Sangeeta    28     Pizza  Jrd
Rohit       26  Panipuri  Ghy

In [16]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**Add new column**

- If you want to add new column
- First you need to check the number of rows in already existing data
- For e.g in above the dataframe has 4 rows
- You need to create a new list with 4 rows
- That list equate to the data frame

In [20]:
job=['DS','Teacher','Engineer']
Salary=[150000,100000,100001]
df['Job']=job
df['Salary']=Salary
df

           Age      Food City       Job  Salary
Arghyanil   27   Biryani  Hyd        DS  150000
Sangeeta    28     Pizza  Jrd   Teacher  100000
Rohit       26  Panipuri  Ghy  Engineer  100001

$Step-5$

**Updating the existing column**

**Create & Update new column both are same way**

In [21]:
df['Age']=[30,31,29]
df

           Age      Food City       Job  Salary
Arghyanil   30   Biryani  Hyd        DS  150000
Sangeeta    31     Pizza  Jrd   Teacher  100000
Rohit       29  Panipuri  Ghy  Engineer  100001

$Step-6$

**Changing the index**

In [44]:
import pandas as pd

names=['Arghyanil','Sangeeta','Rohit']
age=[27,28,26]
food=['Biryani','Pizza','Panipuri']
city=['Hyd','Jrd','Ghy']
job=['DS','Teacher','Engineer']
Salary=[150000,100000,100001]
idx=['A','B','C']

columns=['Names','Age','Food','City','Job','Salary']
# Combine the lists into a list of tuples
data = zip(names, age, food, city, job, Salary)

# Create the DataFrame with column names
df = pd.DataFrame(data,idx,columns )

print(df)

       Names  Age      Food City       Job  Salary
A  Arghyanil   27   Biryani  Hyd        DS  150000
B   Sangeeta   28     Pizza  Jrd   Teacher  100000
C      Rohit   26  Panipuri  Ghy  Engineer  100001

**Note**

- Number of list equals to **Number of columns**

- Number of values inside list equals to **Number of rows**

- When you create the data all the lists will be in same length

$Step-7$

**shape**

- Number of rows 

- Number of columns

In [66]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 3
the number of columns are: 6

$Step-8$

**Drop the column**

- In order to drop column we required 3 arguments

- Column name

    - The coulmn name we need to mention

- axis

   -  axis=0 **represents rows**

   -  axis=1 **represnts columns**

- inplace

   - we are drop column means we are modifying the data frame

   - so this modifications we want to save in same variable or different variable

   - If you want to keep in the same varaible the **inplace=True**

In [ ]:
df1=df.drop('Food',axis=1)  # do not give inplace=True

In [42]:
df.drop('Food',axis=1,inplace=True)
df

       Names  Age City       Job  Salary
A  Arghyanil   27  Hyd        DS  150000
B   Sangeeta   28  Jrd   Teacher  100000
C      Rohit   26  Ghy  Engineer  100001

$Step-9$

**Multiple columns Drop**

In [45]:
df.drop(['Age','Food'],axis=1,inplace=True)
df

       Names City       Job  Salary
A  Arghyanil  Hyd        DS  150000
B   Sangeeta  Jrd   Teacher  100000
C      Rohit  Ghy  Engineer  100001

$Step-10$

**Drop rows**

In [62]:
import pandas as pd

names=['Arghyanil','Sangeeta','Rohit']
age=[27,28,26]
food=['Biryani','Pizza','Panipuri']
city=['Hyd','Jrd','Ghy']
job=['DS','Teacher','Engineer']
Salary=[150000,100000,100001]
idx=['A','B','C']

columns=['Names','Age','Food','City','Job','Salary']
# Combine the lists into a list of tuples
data = zip(names, age, food, city, job, Salary)

# Create the DataFrame with column names
df = pd.DataFrame(data,idx,columns)

print(df)

       Names  Age      Food City       Job  Salary
A  Arghyanil   27   Biryani  Hyd        DS  150000
B   Sangeeta   28     Pizza  Jrd   Teacher  100000
C      Rohit   26  Panipuri  Ghy  Engineer  100001

In [49]:
df.drop('City',axis=0,inplace=True)

KeyError: "['City'] not found in axis"

In [61]:
df.drop('C',axis=0,inplace=True)
df

       Names  Age     Food City      Job  Salary
A  Arghyanil   27  Biryani  Hyd       DS  150000
B   Sangeeta   28    Pizza  Jrd  Teacher  100000

$Step-11$

**How to save the data frame**

- Generally data frames are two types

- csv (comma seperated value)

- excel

In [64]:
# file name=data
# extension=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [65]:
# Extension
#.xlsx
df.to_excel('data2.xlsx',index=False)

**Practise**

In [23]:
import pandas as pd
names=['Levan Saginashvili','Ermes Gasparini','Devon Laratt','Artyom Morozov','Vitaly Laletin']
nation=['Georgia','Italy','Canada','Kazakhstan','Russia']
Weight=[175,130,117,140,144]
Age=[35,32,49,26,34]
height=[6.3,6.2,6.5,6.4,6.8]
data=zip(names,nation,Weight,Age,height)
idx=[1,2,3,4,5]
column=['Names','Country','Weight','age','Height ft']
am=pd.DataFrame(data,idx,column)
am

                Names     Country  Weight  age  Height ft
1  Levan Saginashvili     Georgia     175   35        6.3
2     Ermes Gasparini       Italy     130   32        6.2
3        Devon Laratt      Canada     117   49        6.5
4      Artyom Morozov  Kazakhstan     140   26        6.4
5      Vitaly Laletin      Russia     144   34        6.8

In [28]:
am['Biceps inch']=[24,21,18,22,17,23]
am

                Names     Country  Weight  age  Height ft  Biceps inch
1  Levan Saginashvili     Georgia     175   35        6.3           24
2     Ermes Gasparini       Italy     130   32        6.2           21
3        Devon Laratt      Canada     117   49        6.5           18
4      Artyom Morozov  Kazakhstan     140   26        6.4           22
5      Vitaly Laletin      Russia     144   34        6.8           17
6     Denis Cyplenkov     Ukraine     133   45        6.1           23

In [27]:

new_row = pd.DataFrame({
                        'Names': ['Denis Cyplenkov'], 
                        'Country': ['Ukraine'], 
                        'Weight': [133], 
                        'age': [45], 
                        'Height ft': [6.1]}, index=[6])

am = pd.concat([am, new_row]) 
am

                Names     Country  Weight  age  Height ft
1  Levan Saginashvili     Georgia     175   35        6.3
2     Ermes Gasparini       Italy     130   32        6.2
3        Devon Laratt      Canada     117   49        6.5
4      Artyom Morozov  Kazakhstan     140   26        6.4
5      Vitaly Laletin      Russia     144   34        6.8
6     Denis Cyplenkov     Ukraine     133   45        6.1

In [25]:
am.drop(0,axis=0,inplace=True)
am

                Names     Country  Weight  age  Height ft
1  Levan Saginashvili     Georgia     175   35        6.3
2     Ermes Gasparini       Italy     130   32        6.2
3        Devon Laratt      Canada     117   49        6.5
4      Artyom Morozov  Kazakhstan     140   26        6.4
5      Vitaly Laletin      Russia     144   34        6.8

In [19]:
am.drop(1,axis=0)

            Names     Country  Weight  age  Height ft  Biceps inch
2    Devon Laratt      Canada     117   49        6.5         18.0
3  Artyom Morozov  Kazakhstan     140   26        6.4         22.0
4  Vitaly Laletin      Russia     144   34        6.8         17.0

In [21]:
am.drop('age',axis=1)

             Names     Country  Weight  Height ft  Biceps inch
1  Ermes Gasparini       Italy     130        6.2         21.0
2     Devon Laratt      Canada     117        6.5         18.0
3   Artyom Morozov  Kazakhstan     140        6.4         22.0
4   Vitaly Laletin      Russia     144        6.8         17.0

In [31]:
am.to_excel('Armwrestling.xlsx')

In [33]:
am

                Names     Country  Weight  age  Height ft  Biceps inch
1  Levan Saginashvili     Georgia     175   35        6.3           24
2     Ermes Gasparini       Italy     130   32        6.2           21
3        Devon Laratt      Canada     117   49        6.5           18
4      Artyom Morozov  Kazakhstan     140   26        6.4           22
5      Vitaly Laletin      Russia     144   34        6.8           17
6     Denis Cyplenkov     Ukraine     133   45        6.1           23